tutorials/thermoFluidSolidInteraction/thermalCavity/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type          zeroGradient;
        value         uniform 0;

        // type newElasticWallPressure;
	// virtualWallThickness uniform 0.001;
        // value uniform 0;
    }

    left
    {
        type           zeroGradient;
        value          uniform 0;
    }

    right
    {
	type           zeroGradient;
	value          uniform 0;
    }

    top
    {
	type           zeroGradient;
	value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
